In [25]:
import pandas as pd

In [26]:
df = pd.read_excel('apartment_00.xlsx')

In [27]:
df.head()

,Unnamed: 0,0,1,2,3
0,title,"['3 BHK Apartment', 'Apartment4 BHK ', 'BHK Ap...","['1 BHK Apartment', 'Apartment1 BHK ', 'BHK Ap...","['2 BHK Apartment', 'Apartment1 BHK ', 'BHK Ap...","['2 BHK Apartment', 'Apartment2 BHK ', 'BHK Ap..."
1,price,"['2.5', '2.25', '11,000', '14,000', '16,000', ...","['5,500', '8,000', '19,000', '7,000', '11,000'...","['12,000', '11,000', '9,000', '10,000', '5,500...","['20,000', '7,500', '13,500', '5,500', '5,600'..."
2,area,"['2000 ', '3150 ', '1100 ', '1200 ', '1500 ', ...","['625 ', '600 ', '1815 ', '1030 ', '1187 ', '9...","['1200 ', '1000 ', '950 ', '870 ', '950 ', '52...","['1500 ', '900 ', '1200 ', '950 ', '600 ', '86..."
3,owner_name,"['Brickhouse Realty Solutions', 'HR Associates...","['G kumawat', 'shubh', 'Total Realty Solutions...","['VIVEK', 'navya associat', 'MATOSHREE REALTY'...","['Virendra Property Consultant', 'Shiwanshu', ..."
4,address,"['Chanakyapuri', 'Chanakyapuri', 'Lokmanya Nag...","['Bhicholi Mardana', 'Scheme Number 136', 'Mah...","['Vijay Nagar', 'Mahalaxmi Nagar Colony', 'Vig...","['Vijay Nagar', 'Manawata Nagar', 'Navlakha', ..."

In [28]:
df.columns

Index(['Unnamed: 0', 0, 1, 2, 3], dtype='object')

In [29]:
df = df.transpose()

In [30]:
df.head()

,0,1,2,3,4
Unnamed: 0,title,price,area,owner_name,address
0,"['3 BHK Apartment', 'Apartment4 BHK ', 'BHK Ap...","['2.5', '2.25', '11,000', '14,000', '16,000', ...","['2000 ', '3150 ', '1100 ', '1200 ', '1500 ', ...","['Brickhouse Realty Solutions', 'HR Associates...","['Chanakyapuri', 'Chanakyapuri', 'Lokmanya Nag..."
1,"['1 BHK Apartment', 'Apartment1 BHK ', 'BHK Ap...","['5,500', '8,000', '19,000', '7,000', '11,000'...","['625 ', '600 ', '1815 ', '1030 ', '1187 ', '9...","['G kumawat', 'shubh', 'Total Realty Solutions...","['Bhicholi Mardana', 'Scheme Number 136', 'Mah..."
2,"['2 BHK Apartment', 'Apartment1 BHK ', 'BHK Ap...","['12,000', '11,000', '9,000', '10,000', '5,500...","['1200 ', '1000 ', '950 ', '870 ', '950 ', '52...","['VIVEK', 'navya associat', 'MATOSHREE REALTY'...","['Vijay Nagar', 'Mahalaxmi Nagar Colony', 'Vig..."
3,"['2 BHK Apartment', 'Apartment2 BHK ', 'BHK Ap...","['20,000', '7,500', '13,500', '5,500', '5,600'...","['1500 ', '900 ', '1200 ', '950 ', '600 ', '86...","['Virendra Property Consultant', 'Shiwanshu', ...","['Vijay Nagar', 'Manawata Nagar', 'Navlakha', ..."

In [188]:
Title, Price, Area, Owner_name, Address = [],[],[],[],[]

In [189]:
for i in range(1): 
    for j in range(4): 
        Title.append(df[i][j])

for i in range(1,2): 
    for j in range(4): 
        Price.append(df[i][j])
        

for i in range(2,3): 
    for j in range(4): 
        Area.append(df[i][j])

for i in range(3,4): 
    for j in range(4): 
        Owner_name.append(df[i][j])

for i in range(4,5): 
    for j in range(4): 
        Address.append(df[i][j])

In [208]:
Address

["['Chanakyapuri', 'Chanakyapuri', 'Lokmanya Nagar', 'Saket Nagar', 'Near bombay hospital', 'Anand Bazar', 'AB Bypass Road', 'Silicon City', 'Khandwa road', 'Scheme No 136', 'Mahalakshmi Nagar', 'Robot Signal', 'Bhawarkuan Road', 'Khandwa Indore Road', 'Bengali Square', 'Bicholi Mardana Road', 'Vijay Nagar', 'Rajendra Nagar', 'MR 9 Road', 'Bhicholi Mardana']",
 "['Bhicholi Mardana', 'Scheme Number 136', 'Mahalakshmi Nagar', 'Manglia', 'Sukliya', 'Vijay Nagar', 'AB Bypass Road', 'Vijay Nagar Main', 'Ekta Nagar', 'Bhicholi Mardana', 'Rau', 'Saket', 'Khajrana', 'Vijay Nagar', 'RRCAT', 'Annapurna road', 'Mahalakshmi Nagar', 'Bhicholi Mardana', 'Vijay Nagar', 'scheme no 78']",
 "['Vijay Nagar', 'Mahalaxmi Nagar Colony', 'Vigyan Nagar Indore', 'Vijay Nagar', 'Bhicholi Mardana', 'aurbindo hospital ujjain road', 'Bhicholi Mardana', 'Limbodi', 'R a c e Course Road', 'Gamle Wale Puliya Indore', 'Nipania', 'Mahalaxmi Nagar Colony', 'Mahalakshmi Nagar', 'Manglia', 'AB Bypass Road', 'Palasia', 'AB Bypass Road', 'Vijay Nagar', 'Vijay Nagar', 'Vijay Nagar']",
 "['Vijay Nagar', 'Manawata Nagar', 'Navlakha', 'AB Bypass Road', 'Limbodi', 'AB Bypass Road', 'Goyal Nagar', 'Indore Khandwa Road', 'Vijay Nagar Main', 'Vijay Nagar', 'Jakhya', 'Nipania', 'Mahalakshmi Nagar', 'Shri Nagar', 'Rau', 'Bhicholi Mardana', 'Bhicholi Mardana', 'Silicon City', 'Bhicholi Mardana', 'Geeta bhavan']"]

In [191]:
new_df = pd.DataFrame()

In [192]:
new_df

Empty DataFrame
Columns: []
Index: []

In [206]:
for i in range(len(df.columns)):
    new_df['Title'] = Title[0][0]

In [183]:
new_df['Title'] = Title[0]

In [217]:
Title[0][:][2]

'3'

In [209]:
df1 = pd.DataFrame([Title, Price, Area, Owner_name, Address], columns = ["a", "b", "c", "d"])

In [211]:
df1 = df1.transpose()

In [212]:
df1

,0,1,2,3,4
a,"['3 BHK Apartment', 'Apartment4 BHK ', 'BHK Ap...","['2.5', '2.25', '11,000', '14,000', '16,000', ...","['2000 ', '3150 ', '1100 ', '1200 ', '1500 ', ...","['Brickhouse Realty Solutions', 'HR Associates...","['Chanakyapuri', 'Chanakyapuri', 'Lokmanya Nag..."
b,"['1 BHK Apartment', 'Apartment1 BHK ', 'BHK Ap...","['5,500', '8,000', '19,000', '7,000', '11,000'...","['625 ', '600 ', '1815 ', '1030 ', '1187 ', '9...","['G kumawat', 'shubh', 'Total Realty Solutions...","['Bhicholi Mardana', 'Scheme Number 136', 'Mah..."
c,"['2 BHK Apartment', 'Apartment1 BHK ', 'BHK Ap...","['12,000', '11,000', '9,000', '10,000', '5,500...","['1200 ', '1000 ', '950 ', '870 ', '950 ', '52...","['VIVEK', 'navya associat', 'MATOSHREE REALTY'...","['Vijay Nagar', 'Mahalaxmi Nagar Colony', 'Vig..."
d,"['2 BHK Apartment', 'Apartment2 BHK ', 'BHK Ap...","['20,000', '7,500', '13,500', '5,500', '5,600'...","['1500 ', '900 ', '1200 ', '950 ', '600 ', '86...","['Virendra Property Consultant', 'Shiwanshu', ...","['Vijay Nagar', 'Manawata Nagar', 'Navlakha', ..."